ObjectStorage/src/Catalogs/ох_НастройкиРегистрацииФайловОбъектногоХранилища/ох_НастройкиРегистрацииФайловОбъектногоХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ох_НастройкиРегистрацииФайловОбъектногоХранилища</name>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФункцииРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРегистрации</name>
    <attributes>
      <name>ПолноеИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ObjectStorage/src/Catalogs/ох_НастройкиРегистрацииФайловОбъектногоХранилища/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДоступныеТипыОбъектовРегистрации();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьОбъектыРегистрации(ТекущийОбъект, ОбъектыРегистрации);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ПолноеИмяФункцииРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ПолноеИмяФункцииРегистрации) Тогда
		
		ЧастиИмениМетода = СтрРазделить(Объект.ПолноеИмяФункцииРегистрации, ".");
		ИмяМетода = ЧастиИмениМетода[ЧастиИмениМетода.ВГраница()];
		
	Иначе
		ИмяМетода = "РегистрацияФайлов";
	КонецЕсли;
	
	ШаблонМетода = СтрШаблон(КонструкторМетода(), ИмяМетода);
	
	Результат = Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(
		Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ШаблонМетода));
	
	Если Результат Тогда
		ПоказатьОповещениеПользователя("Сохранение завершено", , "Шаблон функции сохранен в буфер обмена.");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРегистрации

&НаКлиенте
Процедура ОбъектыРегистрацииВыбратьПриИзменении(Элемент)
	
	ЭлементДерева = ТекущийЭлемент.ТекущиеДанные;
	
	ЭлементДерева.Пометка = СледующееЗначениеПометкиЭлемента(ЭлементДерева);
	
	Если ТребуетсяПометитьВложенныеЭлементы(ЭлементДерева) Тогда
		ПометитьВложенныеЭлементыРекурсивно(ЭлементДерева);
	КонецЕсли;
	
	Если ЭлементДерева.Пометка = ПометкаФлажокНеУстановлен() Тогда
		ЭлементДерева.Пометка = ЗначениеПометкиОтносительноВложенныхЭлементов(ЭлементДерева);
	КонецЕсли;
	
	ПометитьЭлементыРодителейРекурсивно(ЭлементДерева);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеТипыОбъектовРегистрации()
	
	ЗаполнитьРазделыДереваМетаданных();
	ДоступныеТипыОбъектов = ДоступныеТипыОбъектов();
	
	Для Каждого Раздел Из ОбъектыРегистрации.ПолучитьЭлементы() Цикл
		
		ОтборОбъектов = Новый Структура;
		ОтборОбъектов.Вставить("ИмяБазовогоТипа", Раздел.Имя);
		
		ОбъектыРаздела = ДоступныеТипыОбъектов.НайтиСтроки(ОтборОбъектов);
		
		Для Каждого ОбъектМетаданных Из ОбъектыРаздела Цикл
			ДобавитьЗначениеКоллекцииДерева(
				Раздел,
				ОбъектМетаданных.Имя,
				ОбъектМетаданных.ПолноеИмяОбъекта,
				ОбъектМетаданных.Представление,
				Раздел.ИндексКартинки,
				Истина);
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьПометкиДобавленныхРекурсивно(ОбъектыРегистрации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъектыРегистрации(ТекущийОбъект, ЭлементыДерева)
	ТекущийОбъект.ОбъектыРегистрации.Очистить();
	ЗаписатьОбъектыРегистрацииРекурсивно(ТекущийОбъект, ОбъектыРегистрации);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделыДереваМетаданных()
	
	ДобавитьЗначениеКоллекцииДерева(ОбъектыРегистрации, "Справочники"     , "Справочники"     , "Справочники"      , 3);
	ДобавитьЗначениеКоллекцииДерева(ОбъектыРегистрации, "Документы"       , "Документы"       , "Документы"        , 7);
	ДобавитьЗначениеКоллекцииДерева(ОбъектыРегистрации, "РегистрыСведений", "РегистрыСведений", "Регистры сведений", 15);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеТипыОбъектов()
	
	ДанныеОбъектов = Новый ТаблицаЗначений;
	ДанныеОбъектов.Колонки.Добавить("ИмяБазовогоТипа");
	ДанныеОбъектов.Колонки.Добавить("МетаданныеОбъекта");
	ДанныеОбъектов.Колонки.Добавить("ПолноеИмяОбъекта");
	ДанныеОбъектов.Колонки.Добавить("Имя");
	ДанныеОбъектов.Колонки.Добавить("Представление");
	
	ПодпискиНаСобытия = Метаданные.ПодпискиНаСобытия;
	
	ТипыСсылочныхОбъектов = ПодпискиНаСобытия.ох_РегистрацияФайловОбъектногоХранилищаПриЗаписи.Источник.Типы();
	ДобавитьДанныеОбъектов(ДанныеОбъектов, ТипыСсылочныхОбъектов);
	
	ТипыНаборовЗаписей =
		ПодпискиНаСобытия.ох_РегистрацияФайловОбъектногоХранилищаПриЗаписиНабораЗаписей.Источник.Типы();
	ДобавитьДанныеОбъектов(ДанныеОбъектов, ТипыНаборовЗаписей);
	
	ДанныеОбъектов.Сортировать("Представление");
	
	Возврат ДанныеОбъектов;
	
КонецФункции

&НаСервере
Процедура УстановитьПометкиДобавленныхРекурсивно(ЭлементыДерева)
	
	Для Каждого ЭлементДерева Из ЭлементыДерева.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.ПолучитьЭлементы().Количество() Тогда
			УстановитьПометкиДобавленныхРекурсивно(ЭлементДерева);
			ЭлементДерева.Пометка = ЗначениеПометкиОтносительноВложенныхЭлементов(ЭлементДерева);
		Иначе
			
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("ПолноеИмяОбъекта", ЭлементДерева.ПолноеИмя);
			
			ДобавленныеОбъекты = Объект.ОбъектыРегистрации.НайтиСтроки(ОтборСтрок);
			
			Если ДобавленныеОбъекты.Количество() Тогда
				ЭлементДерева.Пометка = ПометкаФлажокУстановлен();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьДанныеОбъектов(ДанныеОбъектов, Источник)
	
	Для Каждого ТипОбъекта Из Источник Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОбъекта);
		
		НовыеДанныеОбъекта = ДанныеОбъектов.Добавить();
		НовыеДанныеОбъекта.ИмяБазовогоТипа   = ох_ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
		НовыеДанныеОбъекта.МетаданныеОбъекта = ОбъектМетаданных;
		НовыеДанныеОбъекта.ПолноеИмяОбъекта  = ОбъектМетаданных.ПолноеИмя();
		НовыеДанныеОбъекта.Имя               = ОбъектМетаданных.Имя;
		НовыеДанныеОбъекта.Представление     = ОбъектМетаданных.Представление();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьЗначениеКоллекцииДерева(
	Коллекция, Имя, ПолноеИмя, Представление, ИндексКартинки, ЭтоОбъектМетаданных = Ложь)
	
	НовыйРаздел = Коллекция.ПолучитьЭлементы().Добавить();
	НовыйРаздел.Имя                 = Имя;
	НовыйРаздел.ПолноеИмя           = ПолноеИмя;
	НовыйРаздел.Представление       = Представление;
	НовыйРаздел.ИндексКартинки      = ИндексКартинки;
	НовыйРаздел.ЭтоОбъектМетаданных = ЭтоОбъектМетаданных;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СледующееЗначениеПометкиЭлемента(ЭлементДерева)
	
	Если ЭлементДерева.ЭтоОбъектМетаданных Тогда
		Если ЭлементДерева.Пометка = 0 Тогда
			Возврат ПометкаФлажокУстановлен();
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементДерева.Пометка = 2 Тогда 
		Возврат ПометкаФлажокНеУстановлен();
	КонецЕсли;
	
	Возврат ЭлементДерева.Пометка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПометкаФлажокНеУстановлен()
	Возврат 0;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПометкаФлажокУстановлен()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПометкаКвадрат()
	Возврат 2;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТребуетсяПометитьВложенныеЭлементы(ЭлементДерева)
	
	Если ЭлементДерева.ЭтоОбъектМетаданных Тогда 
		
		СостояниеВложенныхЭлементов = СостояниеВложенныхЭлементов(ЭлементДерева);
		
		ЕстьПомеченные   = СостояниеВложенныхЭлементов.ЕстьПомеченные;
		ЕстьНепомеченные = СостояниеВложенныхЭлементов.ЕстьНепомеченные;
		
		Если ЕстьПомеченные И ЕстьНепомеченные Тогда 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеВложенныхЭлементов(ЭлементДерева)
	
	ВложенныеЭлементы = ЭлементДерева.ПолучитьЭлементы();
	
	ЕстьПомеченные   = Ложь;
	ЕстьНепомеченные = Ложь;
	
	Для каждого ВложенныйЭлемент Из ВложенныеЭлементы Цикл
		
		Если ВложенныйЭлемент.Пометка = ПометкаФлажокНеУстановлен() Тогда 
			ЕстьНепомеченные = Истина;
			Продолжить;
		КонецЕсли;
		
		Если ВложенныйЭлемент.Пометка = ПометкаФлажокУстановлен() Тогда 
			ЕстьПомеченные = Истина;
			
			Если ВложенныйЭлемент.ЭтоОбъектМетаданных Тогда 
				Состояние = СостояниеВложенныхЭлементов(ВложенныйЭлемент);
				ЕстьПомеченные   = ЕстьПомеченные   Или Состояние.ЕстьПомеченные;
				ЕстьНепомеченные = ЕстьНепомеченные Или Состояние.ЕстьНепомеченные;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если ВложенныйЭлемент.Пометка = ПометкаКвадрат() Тогда 
			ЕстьПомеченные   = Истина;
			ЕстьНепомеченные = Истина;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьПомеченные",   ЕстьПомеченные);
	Результат.Вставить("ЕстьНепомеченные", ЕстьНепомеченные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПометитьВложенныеЭлементыРекурсивно(ЭлементДерева)
	
	ВложенныеЭлементы = ЭлементДерева.ПолучитьЭлементы();
	
	Для каждого ВложенныйЭлемент Из ВложенныеЭлементы Цикл
		
		ВложенныйЭлемент.Пометка = ЭлементДерева.Пометка;
		ПометитьВложенныеЭлементыРекурсивно(ВложенныйЭлемент);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПометкиОтносительноВложенныхЭлементов(ЭлементДерева)
	
	СостояниеВложенныхЭлементов = СостояниеВложенныхЭлементов(ЭлементДерева);
	
	ЕстьПомеченные   = СостояниеВложенныхЭлементов.ЕстьПомеченные;
	ЕстьНепомеченные = СостояниеВложенныхЭлементов.ЕстьНепомеченные;
	
	Если ЭлементДерева.ЭтоОбъектМетаданных Тогда 
		
		Если ЭлементДерева.Пометка = ПометкаФлажокУстановлен() Тогда 
			Возврат ПометкаФлажокУстановлен();
		КонецЕсли;
		
		Если ЭлементДерева.Пометка = ПометкаФлажокНеУстановлен()
			Или ЭлементДерева.Пометка = ПометкаКвадрат() Тогда 
			
			Если ЕстьПомеченные Тогда
				Возврат ПометкаКвадрат();
			Иначе 
				Возврат ПометкаФлажокНеУстановлен();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе 
		
		Если ЕстьПомеченные Тогда
			
			Если ЕстьНепомеченные Тогда
				Возврат ПометкаКвадрат();
			Иначе
				Возврат ПометкаФлажокУстановлен();
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ПометкаФлажокНеУстановлен();
		
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПометитьЭлементыРодителейРекурсивно(ЭлементДерева)
	
	Родитель = ЭлементДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = Родитель.ПолучитьЭлементы();
	Если ЭлементыРодителя.Количество() = 0 Тогда
		Родитель.Пометка = ПометкаФлажокУстановлен();
	ИначеЕсли ЭлементДерева.Пометка = ПометкаКвадрат() Тогда
		Родитель.Пометка = ПометкаКвадрат();
	Иначе
		Родитель.Пометка = ЗначениеПометкиОтносительноВложенныхЭлементов(Родитель);
	КонецЕсли;
	
	ПометитьЭлементыРодителейРекурсивно(Родитель);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъектыРегистрацииРекурсивно(ТекущийОбъект, ЭлементыДерева)
	
	Для Каждого ЭлементДерева Из ЭлементыДерева.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.ПолучитьЭлементы().Количество() Тогда
			ЗаписатьОбъектыРегистрацииРекурсивно(ТекущийОбъект, ЭлементДерева);
		Иначе
			
			Если ЭлементДерева.Пометка = ПометкаФлажокУстановлен()
				И ЭлементДерева.ЭтоОбъектМетаданных Тогда
				НоваяСтрока = ТекущийОбъект.ОбъектыРегистрации.Добавить();
				НоваяСтрока.ПолноеИмяОбъекта = ЭлементДерева.ПолноеИмя;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КонструкторМетода()
	
	Возврат "// Формирует данные регистрации файлов для объекта, указанного в настройках регистрации.
	|//
	|// Параметры:
	|//  Источник - СправочникОбъект
	|//             ДокументОбъект
	|//             РегистрСведенийНаборЗаписей - регистрируемый объект.
	|//  ЭтоУдаление - Булево - Истина, если обработчик вызван перед удалением объекта.
	|//
	|// Возвращаемое значение:
	|//  ТаблицаЗначений - данные регистрации с колонками Файл, Владелец и Операция.
	|//
	|Функция %1(Источник, ЭтоУдаление = Ложь) Экспорт
	|	
	|	ДанныеРегистрации = ох_РегистрацияФайловОбъектногоХранилища.НовыйДанныеРегистрации();
	|	//...
	|	Возврат ДанныеРегистрации;
	|	
	|КонецФункции";
	
КонецФункции

#КонецОбласти
